11_Rails_Intro_Controller/bookazon_app/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "genre", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)
    if @book.save

UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Hello"], ["updated_at", "2015-09-10 04:15:43.016386"], ["id", 3]]
---
  def update
    @book = get_book
    if @book.update(book_params)